In [1]:
import pandas as pd

C:\Users\Mimi Renno\AppData\Local\Temp\ipykernel_13320\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
df_consoles = pd.read_excel("best-selling game consoles.xlsx",sheet_name="consoles")

In [4]:
df_consoles.head()

,Console Name,Type,Company,Released Year,Discontinuation Year,Units sold (million),Remarks
0,PlayStation 2,Home,Sony,2000,2013,155.00,Final sales are greater than 155 million
1,Nintendo DS,Handheld,Nintendo,2004,2013,154.02,NaN
2,Nintendo Switch,Hybrid,Nintendo,2017,0,122.55,NaN
3,Game Boy,Handheld,Nintendo,1989,2003,64.42,The Game Boy (1989) and the Game Boy Color (19...
4,Game Boy Color,Handheld,Nintendo,1998,2003,44.06,NaN

# Exercício 1

In [19]:
df_consoles.groupby("Company")[["Console Name"]].count()
df_qtd = df_consoles.groupby("Company")[["Console Name"]].count()
df_qtd = df_qtd.rename(columns={"Console Name": "Qtd"})

In [20]:
df_qtd

                         Qtd
Company
Atari                      4
Bandai                     1
Coleco                     2
Magnavox/Philips           1
Mattel                     1
Micro Genius               1
Microsoft                  4
NEC                        1
NEC/Hudson Soft[note 6]    1
Nintendo                  17
Nokia                      1
Philips                    1
Sega                       7
Sony                       7
Tectoy                     2

# Exercício 02

In [12]:
df_sort = df_qtd.sort_values("Qtd", ascending = False)
df_sort

                         Qtd
Company
Nintendo                  17
Sega                       7
Sony                       7
Atari                      4
Microsoft                  4
Coleco                     2
Tectoy                     2
Bandai                     1
Magnavox/Philips           1
Mattel                     1
Micro Genius               1
NEC                        1
NEC/Hudson Soft[note 6]    1
Nokia                      1
Philips                    1

# Exercício 03

In [13]:
company_df = pd.read_csv("company.txt", sep = ",")

In [14]:
company_df.head()

            Company  Market Value
0             Atari          4160
1            Bandai           913
2            Coleco           767
3  Magnavox/Philips           693
4            Mattel           548

In [28]:
df_join  = df_sort.merge(company_df, on = "Company", how = "left")

In [29]:
df_join.head()

     Company  Qtd  Market Value
0   Nintendo   17         22615
1       Sega    7         10391
2       Sony    7          7177
3      Atari    4          4160
4  Microsoft    4          3154

# Exercício 04

In [31]:
valor_medio = sum(df_join["Market Value"])/sum(df_join["Qtd"])

In [32]:
print(f"O valor médio é de: {round(valor_medio,2)}")

O valor médio é de: 1100.29